Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: However, if on a particular job it can make PHP work so your boss doesn' t tell you to use a commercial product, that's all that really matters.
es: Sin embargo, si un determinado trabajo hace la tarea de PHP, el jefe no contaria con nosotros para usar un producto comercial, esto es lo que realmente suele pasar.

source: id is a connection id or result id on which to change the settings.For SQLSetConnectOption(), this is a connection id.
es: Para SQLSetConnectOption(), esta es una conexion id.

source: For SQLSetStmtOption(), this is a result id.
es: Para SQLSetStmtOption(), este es un resultado id.

source: Function is the ODBC function to use.
es: function es la funcion ODBC a usar.

source: The value should be 1 for SQLSetConnectOption() and 2 for SQLSetStmtOption().
es: El valor deberia ser 1 para SQLSetConnectOption() y 2 para SQLSetStmtOption().

source: Parameter option is the option to set.
es: Parmeter option es la opcion a configurar.

source: Parameter param is the value for the given option.
es: El parametro param es el valor para la escogida opcion option.

source: ODBC Setoption Examples
es: Ejemplos ODBC Setoption

source: Option 102 of SQLSetConnectOption() is SQL_AUTOCOMMIT. / / Value 1 of SQL_AUTOCOMMIT is SQL_AUTOCOMMIT_ON. / / This example has the same effect as / / odbc_autocommit($conn, true); odbc_setoption ($conn, 1, 102, 1); / / 2.
es: Option 102 of SQLSetConnectOption() is SQL_AUTOCOMMIT. / / Value 1 of SQL_AUTOCOMMIT is SQL_AUTOCOMMIT_ON. / / Este ejemplo tiene el mismo efecto que / / odbc_autocommit($conn, true); odbc_setoption ($conn, 1, 102, 1); / / 2.

source: Option 0 of SQLSetStmtOption() is SQL_QUERY_TIMEOUT. / / This example sets the query to timeout after 30 seconds. $result = odbc_prepare ($conn, $sql); odbc_setoption ($result, 2, 0, 30); odbc_execute ($result);
es: Option 0 of SQLSetStmtOption() is SQL_QUERY_TIMEOUT. / / Este ejemplo asigna el tiempo de espera de la consulta a 30 segundos. $result = odbc_prepare ($conn, $sql); odbc_setoption ($result, 2, 0, 30); odbc_execute ($result);

source: You can suppress the error output of opendir() by prepending `@ 'to the front of the function name.
es: Devuelve un manejador de directorio para ser usado con las llamadas closedir(), readdir() y rewinddir().

source: Values for option and facility are given below.
es: openlog() abre una conexión con el logger del sistema.

source: The facility The facility argument is used to specify what type of program is logging the message.
es: La cadena ident se a¤ade a cada mensaje.

source: The use of openlog() is optional.
es: Los valores de option y facility se exponen en la siguiente sección.

source: Table 1. openlog() Options
es: El uso de openlog() is opcional; Esta será llamada automaticamente por syslog() si fuera necesario, en este caso ident valdrá por defecto FALSE.

source: LOG_AUTHPRIV
es: Ver también syslog() y closelog().

source: The optional notext affects the verbosity of the output; if it is FALSE The optional notext affects the verbosity of the output; if it is FALSE then additional human-readable information is included in the output.
es: The optional notext affects the verbosity of the output; if it is FALSE then additional human-readable information is included in the output.

source: Example 1. openssl_csr_new() example - creating a self-signed-certificate
es: Ejemplo 1. openssl_csr_new() example - creating a self-signed-certificate

source: Example 1. openssl_csr_sign() example - signing a CSR (how to implement your own CA)
es: Ejemplo 1. openssl_csr_sign() example - signing a CSR (how to implement your own CA)

source: Example 1. openssl_error_string() example
es: Ejemplo 1. openssl_error_string() example

source: Example 1. openssl_open() example
es: Ejemplo 1. openssl_open() example

source: Example 1. openssl_pkcs7_decrypt() example
es: Ejemplo 1. openssl_pkcs7_decrypt() example

source: Example 1. openssl_pkcs7_encrypt() example
es: Ejemplo 1. openssl_pkcs7_encrypt() example

source: Example 1. openssl_pkcs7_sign() example
es: Ejemplo 1. openssl_pkcs7_sign() example

source: Example 1. openssl_seal() example
es: Ejemplo 1. openssl_seal() example

source: Example 1. openssl_sign() example
es: Ejemplo 1. openssl_sign() example

source: Example 1. openssl_verify() example
es: Ejemplo 1. openssl_verify() example

source: Table 1. openssl_x509_checkpurpose() purposes
es: Tabla 1. openssl_x509_checkpurpose() purposes

source: Oracle functions
es: Funciones Oracle

source: Returns TRUE if the bind succeeds, otherwise FALSE.
es: Devuelve verdadero si el vínculo se realiza con éxito, y sino devuelve falso.

source: Details about the error can be retrieved using the ora_error() and ora_errorcode() functions.
es: Los detalles de los errores pueden examinarse usando la funciones ora_error() y ora_errorcode().

source: This function binds the named PHP variable with a SQL parameter.
es: Esta función liga la variable PHP nombrada con el parámetro SQL.

source: The SQL parameter must be in the form ":name".
es: El parámtro SQL debe estar en la forma ":name".

source: With the optional type parameter, you can define whether the SQL parameter is an in / out (0, default), in (1) or out (2) parameter.
es: Con el parámetro optativo tipo, se define si el parámetro SQL se trata de un parámetro de entrada / salida (0 y por defecto), entrada (1) o salida (2).

source: As of PHP 3.0.1, you can use the constants ORA_BIND_INOUT, ORA_BIND_IN and ORA_BIND_OUT instead of the numbers.
es: Como en PHP 3.0.1, se puede usar las constantes ORA_BIND_INOUT, ORA_BIND_IN y ORA_BIND_OUT en lugar de los números.

source: ora_bind must be called after ora_parse() and before ora_exec().
es: ora_bind debe ser llamada después de ora_parse() y antes de ora_exec().

source: Input values can be given by assignment to the bound PHP variables, after calling ora_exec() the bound PHP variables contain the output values if available.
es: Los valores de entrada pueden pasarse por asignación a las variables PHP vinculadas, despues de la llamada a ora_exec() dichas variables contendrán los valores de salida, si éstos estuvieran disponibles.

source: Returns TRUE if the close succeeds, otherwise FALSE.
es: Devuelve verdadero si el cierre fué exitoso, o falso de lo contrario.

source: This function closes a data cursor opened with ora_open().
es: Esta función cierra un cursor de datos abierto con ora_open().

source: The returned name is in all uppercase letters.
es: Devuelve el nomre de un campo / columna column en el cursor cursor. el nombre devuelto estará en letras mayúsculas.

source: Returns the Oracle data type name of the field / column column on the cursor cursor.
es: Devuelve el nombre del tipo de datos del campo o columna column en el cursor cursor.

source: The returned type will be one of the following:
es: Se devolverá un tipo de datos, de entre los siguientes:

source: This function commits an Oracle transaction.
es: Esta función realiza una transacción Oracle.

source: A transaction is defined as all the changes on a given connection since the last commit / rollback, autocommit was turned off or when the connection was established.
es: Se define como transacción cualquier cambio en una conexión dada, desde la última tarea / retroceso en la ejecucion (rollback), anulación de la ejecución automática de tareas (autocommit), o cuando se ha establecido la conexión.

source: This function turns off automatic commit after each ora_exec().
es: Esta función deshabilita la ejecucion automatica luego de cada instancia ora_exec().

source: This function turns on automatic commit after each ora_exec() on the given connection.
es: Esta función habilita la ejecucion automatica luego de cada instancia ora_exec() en la conexión dada.

source: Returns the numeric error code of the last executed statement on the specified cursor or connection.
es: Devuelve el codigo numérico de error de la última declaración ejecutada en el cursor o conexion espacificada.

source: Support for connection ids was added in 3.0.4.
es: El soporte para las identificaciones de conexión fue agregado en la versión 3.0.4.

source: Returns an error message of the form XXX - NNNNN where XXX is where the error comes from and NNNNN identifies the error message.
es: Devuelve los mensajes de error en la forma XXX - NNNNN donde XXX es la procedencia del error y NNNNN es la identificación del mensaje de error.

source: See also ora_parse(), ora_fetch(), and ora_do().
es: Los detalles del error pueden verse invocando las funciones ora_error() y ora_errorcode().

source: Returns TRUE (a row was fetched) or FALSE (no more rows, or an error occured).
es: Devuelve verdadero (se extrajo una fila) o falso (no hay mas filas, o ha ocurrido un error).

source: If there was no error, ora_errorcode() will return 0.
es: Si ocurre un error, los detalles del mismo pueden verse invocando las funciones ora_error() y ora_errorcode().

source: Retrieves a row of data from the specified cursor.
es: Si no hubo errores, ora_errorcode() devolverá 0.

source: See also ora_parse(), ora_exec(), and ora_do().
es: Recupera una hilera de datos partiendo de un cursor especificado.

source: Example 1. ora_fetch_into()
es: Ejemplo 1. ora_fetch_into()

source: Returns the column data.
es: Devuelve la columna de datos.

source: If an error occurs, FALSE is returned and ora_errorcode() will return a non-zero value.
es: Si hay un error, se devuelve falso y ora_errorcode() devulve un valor distinto de cero.

source: Note, however, that a test for FALSE on the results from this function may be TRUE in cases where there is not error as well (NULL result, empty string, the number 0, the string "0").
es: Note, de igual manera, que la busqueda de un resultado Falso en esta función, puede resultar verdadera, aún en casos en que no ocurran errores :( resultado NULO, cadenas vacias, valor 0 o cadenas "0").

source: Fetches the data for a column or function result.
es: Extrae los datos para una columna o resultado de función.

source: See also ora_logon().
es: Cierra la sesión de trabajo del usuario, y lo desconecta del servidor.

source: Establishes a connection between PHP and an Oracle database with the given username and password.
es: Establece una conexión entre PHP y una base de datos Oracle, con los datos de nombre de usuario y contraseña especificados.

source: Connections can be made using SQL*Net by supplying the TNS name to user like this:
es: Las conexiones pueden llevarse adelante usando SQL*Net indicando el nombre TNS al usuario de este modo:

source: $conn = Ora_Logon( "user@TNSNAME", "pass");
es: $conn = Ora_Logon( "usuario @TNSNAME ", "contraseña");

source: If you have character data with non-ASCII characters, you should make sure that NLS_LANG is set in your environment.
es: Si hubiesen datos con caracteres no-ASCII, habría que asegurarse de que esté presente la variable de entorno NLS_LANG en el sistema.

source: For server modules, you should set it in the server 's environment before starting the server.
es: Para los modulos de servidor, deberían definirse en el entorno del servidor antes de iniciarlo.

source: Returns a connection index on success, or FALSE on failure.
es: Devuelve el índice de la conexión si aquella tuvo éxito, de lo cantrario devuelve falso.

source: Opens an Oracle cursor associated with connection.
es: Abre un cursor asociado con la conexión.

source: Returns a cursor index or FALSE on failure.
es: Devuelve el índice del cursor o Falso si hay un error.

source: See also ora_exec(), ora_fetch(), and ora_do().
es: Devuelve 0 si se ejecuta con exito, o -1 ante un error.

source: This function undoes an Oracle transaction. (See ora_commit() for the definition of a transaction.)
es: Deshace una transaccion Oracle. (Ver ora_commit() para la definición de transacción.)

source: Returns the ASCII value of the first character of string.
es: Devuelve el valor ASCII del primer caracter de cadena.

source: This function complements chr().
es: Esta función complementa a chr().

source: Example 1. ord() example
es: Ejemplo 1.

source: See also chr().
es: Vea también chr().

source: Example 1. ovrimos_connect() Example
es: Ejemplo 1. ovrimos_connect() Example

source: ovrimos_field_len() is used to get the length of the output column with number field_number, in result result_id.
es: ovrimos_field_len() is used to get the length of the output column.

source: ovrimos_free_result() frees the specified result_id result_id.
es: ovrimos_free_result() frees the specified result_id.

source: It currently sets this parameter the specified result set.
es: Regardless of its taking a result_id as an argument, it currently sets this parameter for all result sets.

source: Example 3. ovrimos_result_all example
es: Ejemplo 3. ovrimos_result_all example

source: Pack given arguments into binary string according to format.
es: Empaqueta los argumentos dados en una cadena binaria siguiendo el formato format.

source: Returns binary string containing data.
es: Devuelve la cadena binaria que contiene los datos.

source: The idea to this function was taken from Perl and all formatting codes work the same as there, however, there are some formatting codes that are missing such as Perl' s "u "format code.
es: El concepto de esta función fue tomado de Perl y todos los códigos de formateo realizan la misma función.

source: The format string consists of format codes followed by an optional repeater argument.
es: La cadena de formato consiste en códigos de formato seguidos por un argumento opcional de repetición.

source: The repeater argument can be either an integer value or * for repeating to the end of the input data.
es: El argumento de repetición puede ser un valor entero o * para repetir hasta el fin de la entrada de datos.

source: For a, A, h, H the repeat count specifies how many characters of one data argument are taken, for @ it is the absolute position where to put the next data, for everything else the repeat count specifies how many data arguments are consumed and packed into the resulting binary string.
es: Para a, A, h, H la cuenta de repetición representa cuántos caracteres se toman de un argumento de datos, para @ es la posición absoluta donde poner los datos siguientes, para todo lo demás la cuenta de repetición especifica cuántos argumentos de datos se toman y empaquetan en la cadena binaria resultante.

source: Currently implemented are
es: Actualmente están implementados:

source: a NUL-padded string
es: a cadena rellena de NUL

source: A SPACE-padded string
es: A cadena rellena de ESPACIOS

source: h Hex string, low nibble first
es: h cadena Hex, primero el medio byte inferior

source: H Hex string, high nibble first
es: H cadena Hex, primero el medio byte superior

source: c signed char
es: c signed (con signo) char

source: C unsigned char
es: C unsigned (sin signo) char

source: s signed short (always 16 bit, machine byte order)
es: s signed short (siempre 16 bits, distribución de bytes de la máquina)

source: S unsigned short (always 16 bit, machine byte order)
es: S unsigned short (siempre 16 bits, distribución de bytes de la máquina)

source: n unsigned short (always 16 bit, big endian byte order)
es: n unsigned short (siempre 16 bits, distribución de bytes gran endian)

source: v unsigned short (always 16 bit, little endian byte order)
es: v unsigned short (siempre 16 bits, distribución de bytes pequeño endian)

source: i signed integer (machine dependent size and byte order)
es: i signed integer (distribución de bytes y tamaños dependientes de la máquina)

source: I unsigned integer (machine dependent size and byte order)
es: I unsigned integer (distribución de bytes y tamaños dependientes de la máquina)

source: l signed long (always 32 bit, machine byte order)
es: l signed long (siempre 32 bits, distribución de bytes de la máquina)

source: L unsigned long (always 32 bit, machine byte order)
es: L unsigned long (siempre 32 bits, distribución de bytes de la máquina)

source: N unsigned long (always 32 bit, big endian byte order)
es: N unsigned long (siempre 32 bits, distribución de bytes gran endian)

source: V unsigned long (always 32 bit, little endian byte order)
es: V unsigned long (siempre 32 bits, distribución de bytes pequeño endian)

source: f float (machine dependent size and representation)
es: f float (representación y tamaño dependientes de la máquina)

source: d double (machine dependent size and representation)
es: d double (representación y tamaño dependientes de la máquina)

source: x NUL byte
es: x byte NUL

source: X Back up one byte
es: X Un byte hacia atrás

source: @ NUL-fill to absolute position
es: @ relleno con NUL en la posición absoluta

source: Example 1. pack() format string
es: Ejemplo 1. cadena de formato para pack

source: The resulting binary string will be 6 bytes long and contain the byte sequence 0x12, 0x34, 0x78, 0x56, 0x41, 0x42.
es: La cadena binaria resultante tendrá 6 bytes de longitud y contendrá la secuencia de bytes 0x12, 0x34, 0x78, 0x56, 0x41, 0x42.

source: Note that the distinction between signed and unsigned values only affects the function unpack(), where as function pack() gives the same result for signed and unsigned format codes.
es: Adviértase que la distinción entre valores signed (con signo) y unsigned (sin signo) sólo afecta a la función unpack(), ya que la función pack() da el mismo resultado para códigos de formato con signo y sin signo.

source: Also note that PHP internally stores integer Also note that PHP internally stores integer values as signed values of a machine dependent size.
es: Nótese también que internamente PHP almacena valores enteros como valores con signo de un tamaño dependiente de la máquina.

source: If you give it an unsigned integer value too large to be stored that way it is converted to a float which often yields an undesired result.
es: Si le da un valor entero sin signo demasiado grande para ser almacenado, será convertido a un double (doble), lo que a menudo produce resultados no deseados.

source: Example 2. parse_ini_file() example
es: Ejemplo 2. parse_ini_file() example

source: Also, you may want to read the section on variables from outside of PHP.
es: Usando parse_str()

source: See also parse_url(), pathinfo(), set_magic_quotes_runtime(), and urldecode().
es: $cad = "primero=valor segundo[]=esto+funciona segundo[]=otro"; parse_str($cad); echo $primero; / * escribe "valor" * / echo $segundo[0]; / * escribe "esto funciona "* / echo $segundo[1]; / * escribe "otro" * /

source: This function is not meant to validate the given URL, it only breaks it up into the above listed parts.
es: Esta función devuelve una matriz que apunta a alguno de los componentes de la URL que estén presentes.

source: If the return_var argument is present, the return status of the Unix command will be placed here.
es: La función passthru() es similar a la función exec() en que ejecuta una orden (command).

source: This function should be used in place of exec() or system() when the output from the Unix command is binary data which needs to be passed directly back to the browser.
es: Si existe el parámetro return_var, el valor de estado devuelto por la orden Unix se guardará ahí.

source: By setting the Content-type to image / gif and then calling a pbmplus program to output a gif, you can create PHP scripts that output images directly.
es: Esta función debería usarse en lugar de exec() o system() cuando la salida de la orden Unix sean datos binarios que deban ser pasados directamente al navegador.

source: See also exec(), system(), popen(), escapeshellcmd(), and the backtick operator.
es: Véase también exec(), system(), popen(), EscapeShellCmd(), y el operador ` (apóstrofe invertido).

source: Example 1. pathinfo() Example
es: Ejemplo 1. pathinfo() Example

source: Closes a file pointer to a pipe opened by popen().
es: Cierra un fichero que representa un tuberia (pipe) abierta con popen().

source: The file pointer must be valid, and must have been returned by a successful call to popen().
es: El apuntador al fichero debe ser válido, y debe haber sido devuelto por una llamada con éxito a popen().

source: Returns the termination status of the process that was run.
es: Devuelve el estado de terminación del proceso que estaba ejecutándose.

source: See also popen().
es: Ver también popen().

source: Example 1. pcntl_fork() Example
es: Ejemplo 1. pcntl_fork() Example

source: Example 1. pcntl_signal() Example
es: Ejemplo 1. pcntl_signal() Example

source: Table 1. possible values for pid
es: Tabla 1. possible values for pid

source: Table 2. possible values for options
es: Tabla 2. possible values for options

source: Program Execution functions
es: Funciones de ejecución de programas

source: pdf_add_outline() is replaced by pdf_add_note()
es: (PHP 3 = 3.0.12, PHP 4)

source: See also pdf_add_note().
es: The pdf_add_annotation() adds a note with the lower left corner at (llx, lly) and the upper right corner at (urx, ury).

source: Deprecated.
es: The return value is an identifier for the bookmark which can be used as a parent for other bookmarks.

source: See pdf_add_bookmark().
es: Currently this piece of memory is not been freed by any PDF function but it will be taken care of by the PHP memory manager.

source: Draw a counterclockwise circular arc from alpha to beta degrees
es: The PDF_arc() function draws an arc with center at point (x-coor, y-coor) and radius radius, starting at angle start and ending at angle end.

source: See also: pdf_arcn()
es: See also PDF_circle(), PDF_stroke().

source: Add a new page to the document.
es: The PDF_begin_page() function starts a new page with height height and width width.

source: The width and height are specified in points, which are 1 / 72 of an inch.
es: In order to create a valid document you must call this function and PDF_end_page().

source: Common Page Sizes in Points
es: See also PDF_end_page().

source: letter (8.5"✗11")
es: Anterior

source: legal (8.5"✗14")
es: Inicio

source: ledger (17"✗11")
es: Siguiente

source: Draw a circle with center (x, y) and radius r.
es: See also PDF_arc(), PDF_stroke().

source: Use the current path as clipping path.
es: The PDF_clip() function clips all drawing to the current path.

source: (PHP 3 = 3.0.6, PHP 4)
es: This should not be done because pdflib did not open the file, but expects an already open file when PDF_open() is called.

source: Close the generated PDF file, and free all document-related resources.
es: In order to fix this just take out line 190 of the file p_basic.c in the pdflib 0.6 source distribution until the next release of pdflib will fix this.

source: Close an image retrieved with one of the pdf_open_image*() functions.
es: See also PDF_open_jpeg(), PDF_open_gif(), PDF_open_memory_image().

source: Close the path, fill, and stroke it.
es: See also PDF_closepath(), PDF_stroke(), PDF_fill(), PDF_setgray_fill(), PDF_setgray(), PDF_setrgbcolor_fill(), PDF_setrgbcolor().

source: Close the current path.
es: Many functions like PDF_moveto(), PDF_circle() and PDF_rect() start a new path.

source: Close the path, and stroke it.
es: See also PDF_closepath(), PDF_stroke().

source: Print text at the next line.
es: The PDF_continue_text() function outputs the string in text The PDF_continue_text() function outputs the string in text in the next line.

source: The spacing between lines is determined by the leading parameter.
es: See also PDF_show_xy(), PDF_set_leading(), PDF_set_text_pos().

source: Draw a Bezier curve from the current point, using 3 more control points.
es: See also PDF_moveto(), PDF_lineto(), PDF_stroke().

source: Finish the page.
es: See also PDF_begin_page().

source: Deprecated, use one of the stroke, fill, or clip functions instead.
es: See also PDF_closepath().
